#include <stdio.h>

int main()
{
    int a[3][3] = {{10, 20, 30}, {40, 50, 60}, {70, 80, 90}};


}


/*
    Задачи:

        Пусть у нас есть матрица a размера 3 на 3:

            10  20  30
            40  50  60
            70  80  90

        
        1)  Напечатате на экран центральный элемент этой матрицы.
            То есть на экран должно напечататься число 50.


        2)  Напечатайте на экран первый ряд этой матрицы.
            То есть на экран должно напечататься:

                10 20 30

        3)  Напечатайте на экран третий столбец этой матрицы.
            То есть на экран должно напечататься:

                30 60 90

        4)  Напечатайте на экран главную диагональ этой матрицы.
            То есть на экран должно напечататься:

                10 50 90


        5)  Напечатайте на экран побочную диагональ этой матрицы.
            То есть на экран должно напечататься:

                30 50 70


        6)  Напечатайте на экран главную диагональ этой матрицы в обратном порядке.
            То есть на экран должно напечататься:

                90 50 10
*/
