#include <stdio.h>

int main()
{
    int n, m;
    scanf("%i%i", &n, &m);



}


/*
    Задача:

        Напишите программу, которая будет сначала считывать с экрана 2 числа n и m.
        Потом эта программа должна считывать все элементы матрицы.
        Программа должна печатать на экран сумму всех элементов матрицы.

        При этом каждый раз вбивать матрицу руками необязательно.
        Матрицу можно считывать из файла вот так:

            ./a.out < matrix3.txt   (Linux)          a.exe < matrix3.txt   (Windows)


        Проверьте результат работы программы на следующих матрицах:

            ./a.out < matrix3.txt           450

            ./a.out < matrix10.txt          5362

            ./a.out < matrix_tall.txt       1410

            ./a.out < matrix_wide.txt       1605
*/