/*
    Функции это возможно самая полезная возможность любого языка программирования.
    Они позволяют сделать код программы одновременно и понятней и удобней.

    Любая программа на языке C и на многих других языках использует функции.
    Вы тоже уже пользовались функциями, ведь и printf и scanf являются функциями. Функцией также является и main.


    Функция - это сущность, которая ассоциирует с собой набор инструкций и входящие в неё параметры.


    Например, рассмотрим функцию printf:
        
        printf("Hello World");

    Тут эта функция принимает на вход строку "Hello World" и печатает её на экран.
    Конечно, эта функция не с неба взялась, а была написана программистами также на языке C.
    Соответственно, есть где-то код этой функции, в котором написано, что нужно делать и как взаимодействовать с
    операционной системой, чтобы на экране напечаталось то что нужно.
    Нам не нужно разбираться с тем как устроена эта функция, мы просто можем её использовать.

    Мы тоже научимся писать функции, которые потом могут быть многократно использованы нами или другими программистами.
*/


int main()
{
}