/*
    Задача Цифры:

        1)  Напишите рекурсивную функцию digits, которая будет принимать на вход число и печатать
            все цифры этого числа в обратном порядке через пробел через пробел.

            То есть если на вход пришло 17954, то функция должна напечатать:

                4 5 9 7 1

        2)  Напишите рекурсивную функцию digits, которая будет принимать на вход число и печатать
            все цифры этого числа в прямом порядке через пробел через пробел.

            То есть если на вход пришло 17954, то функция должна напечатать:

                1 7 9 5 4
*/


#include <stdio.h>


int main()
{
    digits(17954);
}

