#include <stdio.h>

int main()
{
    int a[10] = {42, 75, 21, 82, 83, 89, 20, 99, 36, 63};
}



/*
    Задачи
    
        Пусть у нас есть массив  a   состоящий из 10 элементов.
        

        1)  Напечатайте на экран каждый второй элемент массива, начиная с элемента с индексом 0.
            То есть для данного массива программа должна напечатать:

                42 21 83 20 36


        2)  Напечатайте на экран только чётные элементы данного массива.
            То есть для данного массива программа должна напечатать:

                42 82 20 36


        3)  Напечатайте массив 2 раза. Каждый раз в новой строке
            То есть для данного массива программа должна напечатать:

                42 75 21 82 83 89 20 99 36 63
                42 75 21 82 83 89 20 99 36 63


        4)  Напечатайте массив, при этом печатая каждый элемент по 2 раза
            То есть для данного массива программа должна напечатать:

                42 42 75 75 21 21 82 82 83 83 89 89 20 20 99 99 36 36 63 63


        5)  Напечатайте массив наоборот
            То есть для данного массива программа должна напечатать:

                63 36 99 20 89 83 82 21 75 42


        6)  Вычислите сумму этого массива и напечатайте
            То есть для данного массива программа должна напечатать:

                610


        7)  Напечатайте индексы и сами элементы этого массива в следующем формате
                индекс: элемент

            то есть нужно напечатать вот это:

                0: 42
                1: 75
                2: 21
                3: 82
                4: 83
                5: 89
                6: 20
                7: 99
                8: 36
                9: 63
*/