/*
    Задача:

        Пусть у нас есть массив:
            
            int a[10] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};

        На вход программе поступают 2 числа, второе больше первого. Вам нужно увеличить на 1 все числа в подмассиве,
        описываемым этими числами и напечатать массив a.

        Например, если на вход приходят

            2 6

        то нужно напечать

            10 20 31 41 51 61 70 80 90 100


        Какие индексы нужно передать на вход, что программу увеличила на 1 все элементы массива?
        Какие индексы нужно передать на вход, что программу увеличила только элемент 50?

*/


#include <stdio.h>

int main()
{
    int a[10] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};


}