/*
    Задача:

        Пусть у нас есть массив:
            
            int a[10] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};

        На вход программе поступают 2 числа, второе больше первого. Вам нужно напечатать сумму подмассива,
        описываемым этими числами.

        Вот какой выход программы должен быть при данных входах:

            Вход    |    Выход
                    |    
            2 6     |    180
            1 2     |    20
            0 3     |    60
            9 10    |    100
            0 10    |    550
            
*/


#include <stdio.h>

int main()
{
    int a[10] = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100};


}