/* 
    Функция main

    Любая программа на языке C должна содержать функцию main.
    Эта функция является точкой входа в программу, с неё программа начинает своё выполнение.

    Тему Функции мы будем проходить через несколько занятий.
    На данный момент единственное, что вы должны знать, это то что весь код нужно 
    писать внутри фигурных скобочек {} у функции main.


    Данный файл содержит простейшую программу на языке C. 
    Она ничего не делает, так как внутри фигурных скобочек {} ничего не написано.


    Также в этой программе есть комментарии. Комментарии в языке C начинаются с символов /* и заканчиваются этими же символами, 
    но в обратном порядке. То есть комментарии это то, что вы сейчас читаете.
    Комментарии полностью отбрасываются компилятором и никак не влияют на программу.



    Скомпилируйте данную программу так:

        gcc 02simplest.c

    и запустите её так:

        ./a.out      (на Linux)              a.exe       (на Windows)


    После запуска программа должна сразу завершить и ничего не должно произойти.
*/


int main() {}