/*
    Задача:

        На вход приходят два положительных целых числа a и b, причем известно, что:

            0 <= a <= 2^63
            0 <= b <= 2^63

        Считайте эти два числа и напечатайте их сумму.
        Проверьте работу программу на следующих тестах:


        Вход                                        Выход
                                   
        2 5                                         7
        2000000000 2000000000                       4000000000
        20000000000 20000000000                     40000000000
        18446744073709551614 1                      18446744073709551615
        9000000000000000000 8000000000000000000     17000000000000000000
*/

#include <stdio.h>

int main()
{

}