/*
    Задача

        Напишите программу, которая считывает 2 числа - количество часов и количество минут
        и печатает их в формате времени  hh:mm


        Если на вход подаются числа 10 и 20, то программа должна напечатать  10:20
        Если на вход подаются числа 10 и 5,  то программа должна напечатать  10:05
        Если на вход подаются числа 1 и 5,   то программа должна напечатать  01:05
        Если на вход подаются числа 0 и 5,   то программа должна напечатать  00:05
        Если на вход подаются числа 0 и 0,   то программа должна напечатать  00:00
        Если на вход подаются числа 120 и 5, то программа должна напечатать 120:05
*/


#include <stdio.h>


int main()
{

}



