/*
    Задача:

        На вход поступает число n, а затем n чисел. Известно, что 0 < n < 1000.
        Вам нужно поменять местами минимальный элемент и самый первый.

        Вход                                |   Выход
        ____________________________________________________________
        10                                  |   20 75 21 82 83 89 42 99 36 63
        42 75 21 82 83 89 20 99 36 63       |    
        ____________________________________|_______________________
        3                                   |   10 50 40
        40 50 10                            |    
        ____________________________________|_______________________
        5                                   |   10 40 30 20 50
        50 40 30 20 10                      |    

*/


#include <stdio.h>

int main()
{
    int n;
    scanf("%i", &n);

    int a[1000];
    for (int i = 0; i < n; ++i)
    {
        scanf("%i", &a[i]);
    }



}