/*
    Задача:

        На вход поступает число n, а затем n чисел. Известно, что 0 < n < 1000.
        Вам нужно напечатать все попарные суммы соседних элементов.

        Вход                                |   Выход
        ____________________________________|_______________________________________
        5                                   |   30 50 70 90
        10 20 30 40 50                      |    
        ____________________________________________________________________________
        10                                  |   117 96 103 165 172 109 119 135 99
        42 75 21 82 83 89 20 99 36 63       |    
        ____________________________________|_______________________
        3                                   |   120 24
        100 20 4                            |    


*/


#include <stdio.h>

int main()
{
    int n;
    scanf("%i", &n);

    int a[1000];
    for (int i = 0; i < n; ++i)
    {
        scanf("%i", &a[i]);
    }



}