/*
    Операторы сравнения равно и неравно

    Оператор равно   == берёт 2 числа и возвращает 1 если числа равны или 0 иначе
    Оператор неравно != берёт 2 числа и возвращает 1 если числа не равны  или 0 иначе


*/

#include <stdio.h>

int main()
{
    printf("%i\n", 10 == 10);
    printf("%i\n", 20 == 10);

    printf("%i\n", 10 != 10);
    printf("%i\n", 20 != 10);
}


/*
    Задача:

        Что напечатает данная программа.
        Проверьте свои догадки скомпилировав программу и запустив её.
*/