/*
    Операторы сравнения больше или равно и меньше или равно

    Оператор больше или равно >= берёт 2 числа и возвращает 1 если первое число больше или равно чем второе или 0 иначе
    Оператор меньше или равно <= берёт 2 числа и возвращает 1 если первое число меньше или равно чем второе или 0 иначе

*/

#include <stdio.h>

int main()
{
    printf("%i\n", 20 >= 10);
    printf("%i\n", 20 <= 10);

    printf("%i\n", 10 > 10);
    printf("%i\n", 10 < 10);

    printf("%i\n", 10 >= 10);
    printf("%i\n", 10 <= 10);
}


/*
    Задача:

        Что напечатает данная программа.
        Проверьте свои догадки скомпилировав программу и запустив её.
*/