/*
    Задача:

        Напишите программу, которая находит и печатает все делители всех чисел от 2 до 200
        за исключением тривиальных делителей (1 и само число).
        Если число простое то за место делителей нужно напечатать prime

        Напечатать всё нужно в следующем формате:

            2: prime
            3: prime
            4: 2
            5: prime
            6: 2 3
            7: prime
            8: 2
            9: 3
            10: 2 5
            11: prime
            ...
            и так далее до 200


*/



#include <stdio.h>

int main() 
{
}