/*
    Задачи:
        
        1)  Создайте двумерный динамический массив, который изображен на рисунке в файле classroom_tasks_segments.pdf 
            в части Двумерный динамический массив. Код нужно написать в функции main.
            Вы должны выделить память и инициализировать её в соответствии со схемой на рисунке.
            Нужно создать также одномерный динамический массив sizes

        2)  Напишите и проверьте функции:
            
                void print_two_dim_array(int n, int* sizes, int** array) - печать такого массива на экран
                
                void delete_two_dim_array(int n, int* sizes, int** array) - освобождение памяти
*/

int main(){}