#include <stdio.h>
#include <string.h>

int main() 
{

}

/*
    Задачи:

        1)  Объявить и инициализировать массив, содержащий следующие 10 фильмов:

                {"The Godfather", 175, 8.735, {14, 3, 1972}},
                {"The Shawshank Redemption", 142, 9.112, {10, 9, 1994}},
                {"Fight Club", 175, 8.651, {10, 9, 1999}},
                {"The Matrix", 131, 8.491, {24, 3, 1999}},
                {"Pulp Fiction", 154, 8.620, {19, 5, 1994}},
                {"Citizen Kane", 119, 7.826, {1, 5, 1941}},
                {"A Clockwork Orange", 137, 7.959, {19, 12, 1971}},
                {"2001: A Space Odyssey", 149, 7.988, {2, 4, 1968}},
                {"Finding Nemo", 175, 7.862, {30, 05, 2003}},
                {"(500) Days of Summer", 95, 7.6, {17, 1, 2009}}

        2)  В новой строке изменить день выхода фильма Pulp Fiction с 19-го мая на 21-е мая.
    

        3)  Написать функцию print_movie_array(struct movie* movies, size_t n), которая бы печатала массив структур movies.
            Вызовите её из функции main().


        4)  Написать функцию, которая по массиву фильмов находит средний рейтинг.
*/