/*
    Задача:

        Напишите функцию divide, которая будет принимать на вход два целых числа типа int.
        Эта функция должна делить первое число на второе, причём деление должно быть НЕ целочисленным,
        а вещественным. Функция должна возвращать число типа double.
        Протестируйте эту функцию в функции main.


        Передаём в функцию divide       Возврат из функции divide

        1 2                             0.5
        8 2                             4.0
        -5 4                            -1.25
        1 3                             0.333333333333333
*/


#include <stdio.h>

int main()
{


}