/*
    Задача

        1)  Напишите функцию geometric_mean, которая будет принимать на вход два числа типа double
            и возвращать геометрическое среднее этих чисел.

            Геометрическое среднее двух чисел a и b это  квадратный корень от произведения a * b
            Вызовите эту функцию из функции main.


        2)  Напишите функцию geometric_mean_f, которая будет принимать на вход два числа типа float
            и возвращать геометрическое среднее этих чисел. Вызовите эту функцию из функции main.


        В обоих задачах предполагайте, что на вход приходят неотрицательные числа.

        
        Протестируйте функцию на следующих тестах:
        
        Аргументы функции geometric_mean        Выход функции geometric_mean

        5 10                                    7.0710678118655
        5 0                                     0.0
*/

#include <stdio.h>
#include <math.h>


int main()
{
}