/*
    Задача

        Напишите функцию 

            float distance(float x1, float y1, float x2, float y2)

        которая будет возвращать расстояние между точками (x1, y1) и (x2, y2) на плоскости. 
        
        Протестируйте функцию на следующих тестах:
        
        Аргументы функции distance              Выход функции distance

        0 0 1 1                                 1.414214
        -1 1 0 0                                1.414214
        0 0 5000 0                              5000.0
        7 -3 -5 4                               13.89244
*/

#include <stdio.h>
#include <math.h>


int main()
{
}