/*
    Задача

        Напишите функцию 

            double harmonic(int n)

        которая будет вычислять сумму первых n слагаемых гармонического ряда. 
        
        Гармонический ряд это ряд вида

            1 + 1/2 + 1/3 + 1/4 + 1/5 + 1/6 + ...
        
        
        Аргумент функции harmonic              Выход функции harmonic


        1                                       1.0
        2                                       1.5
        4                                       2.083333
        10                                      2.928968
        100                                     5.187378
        1000                                    7.485471
        1000000                                 14.392727
*/

#include <stdio.h>
#include <math.h>


int main()
{
}