/*
    Задача:

        Напишите функцию double binpow(double x, unsigned long long n), которая будет возводить число x
        в степень n. Сложность алгоритма должна быть O(log(n)). Используйте рекурсию. 


            Вход в функцию binpow                   Выход

            2.0 2                                   4.0
            2.0 16                                  65536.0
            5.6 6                                   30840.979456

            1.234 1000                              2.066140e+91
            0.9995 10000                            6.729527e-03
            1.00000000000001 10000000000000000      2.481623e+43
            
            
*/

#include <stdio.h>

int main()
{

}
