/*
    Целочисленное деление

    Если вы никогда не программировали, то вам может показаться странным то, как работает деление чисел типа int.

    Переменные типа int это целые числа, и результат деления двух переменных типа int тоже будет числом типа int.
    Соответственно результат деления двух целых чисел будет целым числом.

*/


#include <stdio.h>


int main()
{
    int a = 20;
    int b = 7;
    printf("%i\n", a / b);

    printf("%i\n", 30 / 16);
}



/*
    Задачи:

        1)  Попробуйте понять, что напечатает данная программа

        2)  Проверьте свои догадки, скомпилировав программу и запустив её
*/